// Задача 13: Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.

// 645 -> 5
// 78 -> третьей цифры нет
// 32679 -> 6

Console.Write("Введите число для отображения его третьей цифры - ");
int a = int.Parse(Console.ReadLine());

if (a > -100 && a < 100)
{
    Console.WriteLine("В введенном числе нет третьей цифры");
}

else
{

    while (a / 1000 != 0)
    {
        a = a / 10; 
    }

    a = a % 10;

    Console.WriteLine($"Третья цифра числа - {a}");

}

