// Задача 10: Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает 
//вторую цифру этого числа.
//456 -> 5
//782 -> 8
//918 -> 1

Console.WriteLine("Введите трехзначное число (от 100 до 999) - ");
int a = int.Parse(Console.ReadLine());

int a1 = (a % 100) / 10;
Console.WriteLine($"Вторая цифра введенного числа - {a1}");
